{
  "backend/main.mo": "Defines player, team, budget, and user profile types with authorization checks, and provides CRUD operations plus profile and team-access logic using persistent maps.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of major frontend files including pages, components, hooks, and config.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables for light and dark modes and applying global background and text styles.",
  "frontend/index.html": "Base HTML file defining root element and loading the main React entry script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for login, team, and admin pages with a root layout handling profile setup display.",
  "frontend/src/components/AdminHeader.tsx": "Admin header component showing admin info and providing logout behavior with styled UI elements.",
  "frontend/src/components/PlayerManagement.tsx": "Admin UI for listing, creating, editing, and deleting players with dialogs and React Query mutations.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for first‑time users to submit their display name, saving the profile via backend mutation.",
  "frontend/src/components/TeamHeader.tsx": "Team dashboard header showing team name and remaining purse with logout functionality.",
  "frontend/src/components/TeamManagement.tsx": "React UI for creating teams, updating purses, and assigning or removing players using query hooks and dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity persistence, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for players, teams, budgets, and user profiles using the backend actor.",
  "frontend/src/index.css": "Tailwind base configuration with custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard that redirects by role and shows tabs for managing players and teams.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity and redirecting users based on their stored profile.",
  "frontend/src/pages/TeamDashboardPage.tsx": "React page showing a team’s dashboard, fetching user profile, team data, purse info, and rendering stats and tables with redirects for unauthenticated or admin users.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning them from URL hashes.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing app purpose, existing features, and pending feature requests for a cricket auction system."
}