{
  "backend/main.mo": "Defines the backend actor with authorization mixin, data types for players, teams, matches, auctions, and provides storage and utility functions including remaining purse calculation and user profile queries.",
  "feature_evidence.json": "Feature evidence report linking a deployment feature to relevant files, components, and tests with high confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend files describing their purposes and behaviors.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing steps to build and publish Draft Version 15 to production, including checklists, smoke tests, and rollback plan.",
  "frontend/index.css": "Defines global styles and OKLCH-based color variables for light and dark modes with Tailwind layers.",
  "frontend/index.html": "HTML entry point enabling dark mode and loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root layout with optional profile setup modal and Internet Identity integration.",
  "frontend/src/components/AdminHeader.tsx": "Admin header component showing admin info with login/logout controls and navigation using Internet Identity.",
  "frontend/src/components/LeadingTeamIndicator.tsx": "UI component showing a glowing 'Leading' badge with crown icon and team name for auction leader display.",
  "frontend/src/components/MatchManagement.tsx": "Provides UI to create matches and edit match results using form dialogs and mutation hooks.",
  "frontend/src/components/PlayerAuctionDialog.tsx": "Manages player auction flow including starting auctions, placing bids, and assigning players after bidding.",
  "frontend/src/components/PlayerManagement.tsx": "Handles listing, creating, editing, deleting players, team assignments, and launching player auctions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Simple modal allowing users to save their profile name using a mutation.",
  "frontend/src/components/TeamBoughtPlayersSection.tsx": "Displays players purchased by a specific team with loading and error states.",
  "frontend/src/components/TeamHeader.tsx": "Renders team header UI with purse info and login/logout controls tied to Internet Identity.",
  "frontend/src/components/TeamManagement.tsx": "Admin UI for creating teams, updating purses, and assigning or removing players using dialogs and mutations.",
  "frontend/src/components/TeamMatches.tsx": "Displays match cards filtered by team, handling loading, errors, and winner highlighting.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and handling login/logout logic.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating players, teams, matches, and user profiles via the actor.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders admin dashboard tabs for managing players, teams, and matches after loading user profile.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login and redirects users based on profile, with options for anonymous navigation.",
  "frontend/src/pages/TeamDashboardPage.tsx": "React page that loads the user's team or a selected team, fetching players, purse, and matches, and renders a dashboard with team info and selectors.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session-based persisted parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project state, including schema version, features, and deployment-related metadata."
}