{
  "backend/main.mo": "Actor implementing player, team, match, profile, and auction management with access control and extended auction state including fixedIncrement.",
  "backend/migration.mo": "Migration module adding fixedIncrement to existing auction state by transforming stored auctions.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries for all frontend files involved in the project.",
  "frontend/index.css": "Tailwind base/theme definitions using OKLCH colors for light and dark mode styling.",
  "frontend/index.html": "HTML entry point bootstrapping the app with dark mode enabled and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and root layout with optional profile setup modal.",
  "frontend/src/components/AdminHeader.tsx": "Admin header with Internet Identity login/logout controls and navigation actions.",
  "frontend/src/components/MatchManagement.tsx": "Provides UI to create matches, edit match results, and list existing matches using query hooks and dialogs.",
  "frontend/src/components/PlayerAuctionDialog.tsx": "Implements auction flow for an individual player including starting auctions, placing bids, and finalizing results.",
  "frontend/src/components/PlayerManagement.tsx": "Handles creating, editing, deleting, assigning players, and launching player auctions with dialog-driven UI.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for users to enter and save their profile name via a simple form.",
  "frontend/src/components/TeamBoughtPlayersSection.tsx": "Displays players purchased by a specific team with loading and error states.",
  "frontend/src/components/TeamHeader.tsx": "Renders team header with purse info, navigation, and login/logout controls.",
  "frontend/src/components/TeamManagement.tsx": "Manages teams including creation, purse updates, player assignments, and removal using multiple dialogs.",
  "frontend/src/components/TeamMatches.tsx": "Displays match cards, loading and error states, and filters matches by team ID with win/loss indicators.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identities, and auth client setup.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating players, teams, matches, and user profiles via the backend actor with auth‑aware error handling.",
  "frontend/src/index.css": "Sets Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing players, teams, and matches, using identity and profile data.",
  "frontend/src/pages/LoginPage.tsx": "Implements the login screen using Internet Identity and redirects users based on their profile role.",
  "frontend/src/pages/TeamDashboardPage.tsx": "React page showing team dashboards, loading states, team selection, purse details, and match/player info using multiple hooks and UI components.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and cleaning values from hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing auction features, requirements, state versions, and pending requests for fixed bid increments."
}