{
  "backend/BatsmanPerformance.mo": "Defines a BatsmanPerformance record with batting statistics such as runs, balls faced, and boundaries.",
  "backend/BowlerPerformance.mo": "Defines a BowlerPerformance record containing bowling metrics including overs, maidens, runs conceded, and wickets.",
  "backend/FielderPerformance.mo": "Defines a FielderPerformance record with fielding stats like catches, stumpings, and dismissals.",
  "backend/main.mo": "Main backend actor defining domain types for players, teams, matches, scorecards, auctions, and views with authorization mixin.",
  "feature_evidence.json": "Feature evidence report linking features to frontend files, components, and tests with high-confidence mappings.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing routing, pages, components, hooks, and styles.",
  "frontend/.ic-assets.json5": "Asset configuration specifying caching rules and content types for deployment on the Internet Computer.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining path-based routing, SPA hosting requirements, and troubleshooting for blank screens.",
  "frontend/index.css": "Global Tailwind-driven stylesheet defining OKLCH color tokens and base theming for light and dark modes.",
  "frontend/index.html": "HTML entrypoint with dark mode, boot error fallback UI, and scripts for early error capture in production.",
  "frontend/src/App.tsx": "Main React router setup using path-based routing, global error handling, profile setup modal, and legacy hash upgrade.",
  "frontend/src/components/AdminHeader.tsx": "Header showing admin info with login/logout handling and navigation.",
  "frontend/src/components/AuctionSummary.tsx": "Displays team auction statistics and detailed summaries with CSV export support.",
  "frontend/src/components/BallByBallEditor.tsx": "Editor for adding and updating ball‑by‑ball cricket match data including innings, overs, and ball outcomes.",
  "frontend/src/components/CrashFallbackScreen.tsx": "Full‑screen crash UI showing error details with options to refresh or view diagnostics.",
  "frontend/src/components/FatalErrorProvider.tsx": "Context provider that captures fatal errors and renders the crash fallback screen.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that logs errors and displays the crash fallback screen on failure.",
  "frontend/src/components/LeadingTeamIndicator.tsx": "Visual badge indicating the currently leading team.",
  "frontend/src/components/MatchInningsScoreEditor.tsx": "UI for editing batsman and bowler performance per innings with authentication gating.",
  "frontend/src/components/MatchManagement.tsx": "Admin UI for creating, editing, publishing, and managing matches including score, innings, and shareable links.",
  "frontend/src/components/PlayerAuctionDialog.tsx": "Dialog for running live player auctions, handling bid placement, increments, start/stop, and assignment.",
  "frontend/src/components/PlayerManagement.tsx": "CRUD interface for players with team assignments, auctions, and price management.",
  "frontend/src/components/ProfileSetupModal.tsx": "Simple modal for saving the caller’s profile name using a form submission.",
  "frontend/src/components/PublicBallByBallFeed.tsx": "Displays grouped ball‑by‑ball data by innings and over with latest ball highlighting.",
  "frontend/src/components/PublicInningsContextCard.tsx": "Shows current innings context including players, over progress, and last‑ball details.",
  "frontend/src/components/SafeNotFoundRedirect.tsx": "Redirects unknown routes to home without showing a 404 page.",
  "frontend/src/components/TeamBoughtPlayersSection.tsx": "Lists players purchased by a team with loading and error states.",
  "frontend/src/components/TeamHeader.tsx": "Renders a team header with logo, team name, remaining purse, and login/logout handling using Internet Identity.",
  "frontend/src/components/TeamManagement.tsx": "Provides UI to create teams, edit team purse and name, and access owners and bought players management.",
  "frontend/src/components/TeamMatches.tsx": "Displays matches, filtering by team if provided, and shows match details, scores, and win/loss badges.",
  "frontend/src/components/TeamOwnersManagement.tsx": "Manages team owners, allowing adding/removing principals and editing owner display names.",
  "frontend/src/components/TournamentFixturesManagement.tsx": "Generates and previews round-robin tournament fixtures, validating teams and allowing fixture creation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines multiple React Query hooks to fetch and mutate backend data such as players, teams, user profiles, roles, and match-related information via an actor.",
  "frontend/src/index.css": "Sets up Tailwind CSS and defines light/dark theme CSS variables and base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard page showing player, team, match, auction, and tournament management tabs, using identity and profile data to display user info.",
  "frontend/src/pages/DebugPage.tsx": "Diagnostics page displaying backend actor status, user role fetch results, and runtime debug information.",
  "frontend/src/pages/LoginPage.tsx": "Login page enabling Internet Identity login and redirecting users based on profile data, with optional public navigation shortcuts.",
  "frontend/src/pages/NotFoundPage.tsx": "Deprecated empty placeholder component for old 404 handling.",
  "frontend/src/pages/PublicScorecardPage.tsx": "Displays a public cricket scorecard with live data, player name mapping, sharing options, and loading/error states.",
  "frontend/src/pages/TeamDashboardPage.tsx": "Renders a team dashboard showing team data, purse details, players, and a selector when no profile team is set.",
  "frontend/src/utils/ballByBall.ts": "Provides helpers to derive innings context, group balls by innings/over, and identify the latest ball from ball‑by‑ball data.",
  "frontend/src/utils/csvExport.ts": "Generates and downloads a CSV file containing auction summaries for all teams.",
  "frontend/src/utils/globalErrorHandling.ts": "Sets up global window error and unhandled rejection handlers with contextual logging and callback support.",
  "frontend/src/utils/roundRobin.ts": "Generates round‑robin fixtures by creating unique team pairings with assigned round numbers.",
  "frontend/src/utils/runtimeDebugInfo.ts": "Collects and logs runtime environment and URL details for debugging.",
  "frontend/src/utils/shareLinks.ts": "Builds public share URLs and provides clipboard and Web Share API helpers for link sharing.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom theme extensions (colors, radius, shadows), animations, and plugins like typography and container queries.",
  "project_state.json": "Defines the project's state, including routing-related issues, existing and new feature requests, and notes about fixing SPA navigation and removing unexpected 404 pages."
}