{
  "backend/BatsmanPerformance.mo": "Defines a BatsmanPerformance record type with fields for runs, balls faced, boundaries, and innings.",
  "backend/BowlerPerformance.mo": "Defines a BowlerPerformance record type including overs, maidens, runs conceded, wickets, and balls bowled.",
  "backend/FielderPerformance.mo": "Defines a FielderPerformance record type with catches, stumpings, and dismissals.",
  "backend/main.mo": "Main backend actor defining player, team, match, scorecard, auction, and user-related types with authorization mixin included.",
  "feature_evidence.json": "JSON report listing implemented features, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend files, components, hooks, and styling.",
  "frontend/.ic-assets.json5": "Asset configuration specifying caching rules and content-type headers for deployed frontend files.",
  "frontend/DEPLOYMENT.md": "Deployment guide placeholder outlining production build and troubleshooting steps.",
  "frontend/index.css": "Tailwind-based global styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry file including boot error fallback UI and early error-capture script before React mounts.",
  "frontend/src/App.tsx": "Main React application configuring routes, error handling, profile setup logic, and global providers.",
  "frontend/src/components/AdminHeader.tsx": "Header component showing admin info and handling login/logout via Internet Identity.",
  "frontend/src/components/AuctionSummary.tsx": "Displays auction stats and team summaries with CSV export and error/loading states.",
  "frontend/src/components/BallByBallEditor.tsx": "Editor for entering and updating ball‑by‑ball match data with validation and mutation support.",
  "frontend/src/components/CrashFallbackScreen.tsx": "Full‑page crash screen with error details, refresh options, and debugging navigation.",
  "frontend/src/components/FatalErrorProvider.tsx": "Context provider that captures fatal errors and renders the crash fallback screen.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "React error boundary that logs errors and shows the crash fallback UI on failures.",
  "frontend/src/components/LeadingTeamIndicator.tsx": "UI badge indicating the currently leading team with crown icon styling.",
  "frontend/src/components/MatchInningsScoreEditor.tsx": "Authenticated editor for entering and updating batsman and bowler performance by innings.",
  "frontend/src/components/MatchManagement.tsx": "UI for creating, editing, publishing, and managing matches with team selection and score inputs.",
  "frontend/src/components/PlayerAuctionDialog.tsx": "Dialog to run and control live player auctions, including starting auctions and placing bids.",
  "frontend/src/components/PlayerManagement.tsx": "Admin interface for creating, editing, assigning, deleting players, and launching auctions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal allowing a user to enter and save their profile name.",
  "frontend/src/components/PublicBallByBallFeed.tsx": "Displays grouped ball‑by‑ball data by innings and over with highlights for the latest ball.",
  "frontend/src/components/PublicInningsContextCard.tsx": "Shows current innings context such as players, overs, and last‑ball details.",
  "frontend/src/components/TeamBoughtPlayersSection.tsx": "Lists players purchased by a team or shows loading/error states.",
  "frontend/src/components/TeamHeader.tsx": "Displays team name, purse, and authentication controls, handling login/logout via Internet Identity and navigation.",
  "frontend/src/components/TeamManagement.tsx": "Provides UI for creating teams, editing team names and purses, and accessing owner/player management sections.",
  "frontend/src/components/TeamMatches.tsx": "Fetches and displays matches, optionally filtered by team, showing results, scores, and match details.",
  "frontend/src/components/TeamOwnersManagement.tsx": "Manages team owners, allowing adding/removing principals and editing stored owner display names.",
  "frontend/src/components/TournamentFixturesManagement.tsx": "Generates and previews round-robin fixtures for teams, with validation and fixture submission to backend.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for authenticating with Internet Identity, managing identity state, and exposing login-related status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, covering user profiles, players, teams, and related mutations.",
  "frontend/src/index.css": "Configures Tailwind CSS base layers and theme variables for both light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Admin dashboard rendering tabs for managing players, teams, matches, auctions, and tournaments, with identity and profile-based loading states.",
  "frontend/src/pages/DebugPage.tsx": "Diagnostics page showing backend actor status, user role query results, and runtime debug info.",
  "frontend/src/pages/LoginPage.tsx": "Login page handling Internet Identity authentication and redirecting users based on their profile role.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a styled 404 page with navigation buttons to home, admin, and team views.",
  "frontend/src/pages/PublicScorecardPage.tsx": "Fetches and displays a public cricket scorecard with sharing, player lookup, loading, and error states.",
  "frontend/src/pages/TeamDashboardPage.tsx": "Shows a team dashboard with player roster, purse info, and optional team selector based on user profile.",
  "frontend/src/utils/ballByBall.ts": "Provides utilities to derive innings context, group balls by over, and identify the latest ball from ball‑by‑ball data.",
  "frontend/src/utils/csvExport.ts": "Generates and downloads a CSV file summarizing team auction data.",
  "frontend/src/utils/globalErrorHandling.ts": "Sets up global handlers for errors and unhandled rejections, capturing context and invoking an optional callback.",
  "frontend/src/utils/roundRobin.ts": "Generates round‑robin fixtures by creating unique team pairings with sequential round numbers.",
  "frontend/src/utils/runtimeDebugInfo.ts": "Collects and logs runtime environment and location details for debugging.",
  "frontend/src/utils/shareLinks.ts": "Provides utilities for building public share URLs, copying to clipboard, and using the Web Share API.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading URL and hash parameters plus storing, retrieving, and clearing persisted values in sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "JSON metadata describing project state, known issues, and feature requirements for fixing site load failures and adding diagnostics."
}