{
  "backend/main.mo": "Main canister actor defining types, maps, and logic for players, teams, matches, auctions, assignments, and purse calculation with authorization mixin.",
  "backend/migration.mo": "Migration module converting old player-to-team mappings into new playerAssignments with default soldAmount values.",
  "feature_evidence.json": "Feature evidence report documenting addition of 'Sold For' column in player management and related frontend files.",
  "frontend-file-summaries.txt": "Aggregated summaries of multiple frontend files describing their roles in routing, UI components, hooks, and styling.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining steps to build, deploy, test, and roll back the frontend and backend canisters.",
  "frontend/index.css": "Global Tailwind-based style definitions with OKLCH variables for light and dark mode themes.",
  "frontend/index.html": "HTML entry point enabling dark mode and loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, root layout, profile setup modal logic, and document title.",
  "frontend/src/components/AdminHeader.tsx": "Admin header component showing branding, admin name, and authentication controls with navigation.",
  "frontend/src/components/AuctionSummary.tsx": "Displays auction-wide stats and team summaries, handles CSV export, and manages loading and error states.",
  "frontend/src/components/LeadingTeamIndicator.tsx": "Renders a badge and label highlighting the current leading team.",
  "frontend/src/components/MatchManagement.tsx": "Manages creating matches and editing match results, including forms, dialogs, and validation.",
  "frontend/src/components/PlayerAuctionDialog.tsx": "Handles player auction flow with bidding, increment rules, and auction state polling.",
  "frontend/src/components/PlayerManagement.tsx": "Provides CRUD operations for players, team assignments, and auction actions via dialogs.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for saving a user profile name using a simple form.",
  "frontend/src/components/TeamBoughtPlayersSection.tsx": "Fetches and displays players bought by a team with loading and error handling.",
  "frontend/src/components/TeamHeader.tsx": "Header showing team name, purse, navigation, and authentication controls.",
  "frontend/src/components/TeamManagement.tsx": "UI for creating teams, updating purse values, and managing owners with dialogs and mutation hooks.",
  "frontend/src/components/TeamMatches.tsx": "Displays all matches or matches filtered by team, including scores, status, and loading/error states.",
  "frontend/src/components/TeamOwnersManagement.tsx": "Manages adding and removing team owner principals with validation and update mutations.",
  "frontend/src/components/TournamentFixturesManagement.tsx": "Generates and previews round-robin fixtures, handles form inputs, and triggers fixture creation via backend.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, players, teams, assignments, and related auction data with authorization-aware error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes, applying global background, text, and border styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard with tabs for managing players, teams, matches, auction summaries, and fixtures, using user profile data for personalization.",
  "frontend/src/pages/LoginPage.tsx": "Implements login via Internet Identity, redirecting users based on their profile and offering quick navigation to admin and team views.",
  "frontend/src/pages/TeamDashboardPage.tsx": "Displays team details, purse info, and players, supporting profile-based team selection or manual team choice when unauthenticated.",
  "frontend/src/utils/csvExport.ts": "Generates and downloads a CSV file summarizing team auction results including roster, prices, and purse usage.",
  "frontend/src/utils/roundRobin.ts": "Generates simple round‑robin fixtures by pairing all teams uniquely with round numbers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and persisting URL parameters via query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON metadata describing the project state, existing features, and new feature requests related to showing sold amounts and updating team purse calculations."
}