{
  "backend/BatsmanPerformance.mo": "Defines the BatsmanPerformance type with fields for batting stats including runs, balls, boundaries, and innings.",
  "backend/BowlerPerformance.mo": "Defines the BowlerPerformance type containing bowling stats such as overs, maidens, runs conceded, wickets, and balls bowled.",
  "backend/FielderPerformance.mo": "Defines the FielderPerformance type with fields for catches, stumpings, and total dismissals.",
  "backend/main.mo": "Main backend actor defining players, teams, matches, scorecards, auctions, and related storage and helper functions.",
  "backend/migration.mo": "Migration module converting old match records to a new format by adding an empty bowlersByInnings map.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing functionality of all major frontend files, components, hooks, and pages.",
  "frontend/DEPLOYMENT.md": "Deployment guide detailing steps for building, deploying, testing, and rolling back the frontend and backend canisters.",
  "frontend/index.css": "Global Tailwind-based style definitions including OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Base HTML entry file enabling dark mode and loading the React application root and main script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, profile setup modal logic, and document title initialization.",
  "frontend/src/components/AdminHeader.tsx": "Header component showing admin info and handling navigation and authentication actions.",
  "frontend/src/components/AuctionSummary.tsx": "Displays aggregated auction stats and per‑team summaries with CSV export support.",
  "frontend/src/components/LeadingTeamIndicator.tsx": "Renders a badge highlighting the team currently leading in an auction.",
  "frontend/src/components/MatchInningsScoreEditor.tsx": "Provides authenticated UI for editing batsman and bowler performance per innings.",
  "frontend/src/components/MatchManagement.tsx": "Manages match creation, listing, and editing results, including dialogs and validation.",
  "frontend/src/components/PlayerAuctionDialog.tsx": "Dialog for conducting player auctions, handling bidding, increments, and auction state.",
  "frontend/src/components/PlayerManagement.tsx": "UI for creating, editing, deleting, assigning players, and launching player auctions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal that collects a user's name and saves their profile via a mutation with basic validation and toast messages.",
  "frontend/src/components/TeamBoughtPlayersSection.tsx": "Displays players bought by a team, handling loading, error, and empty states using badges and skeletons.",
  "frontend/src/components/TeamHeader.tsx": "Header showing team name, purse, and authentication controls with navigation and identity login/logout handling.",
  "frontend/src/components/TeamManagement.tsx": "Admin interface for creating teams, editing team purse and name, and managing team owners and players.",
  "frontend/src/components/TeamMatches.tsx": "Shows match list filtered by team with loading/error states and displays scores, dates, locations, and win/loss badges.",
  "frontend/src/components/TeamOwnersManagement.tsx": "Manages team owners including adding/removing principals and editing owner display names with dialogs and mutations.",
  "frontend/src/components/TournamentFixturesManagement.tsx": "Generates and previews round-robin tournament fixtures, validating inputs and triggering fixture generation via mutation.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, invalidating related queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading, login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating player, team, match, and user profile data through the backend actor.",
  "frontend/src/index.css": "Configures Tailwind and defines light/dark theme CSS variables for global styling.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboardPage.tsx": "Renders the admin dashboard UI with tabs for managing players, teams, matches, auctions, and tournaments.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login interface, handles Internet Identity login, and redirects users based on their profile role.",
  "frontend/src/pages/TeamDashboardPage.tsx": "Shows a team’s dashboard with players, purse details, and matches, allowing team selection when no profile team is set.",
  "frontend/src/utils/csvExport.ts": "Generates a CSV summary of team auction data and triggers a browser download.",
  "frontend/src/utils/roundRobin.ts": "Creates round‑robin fixtures by pairing all teams into sequential rounds.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines current project state, features, and pending requirements for per‑innings scorecard functionality."
}