{
  "kind": "build_request",
  "title": "Fix deployed site not loading (add runtime diagnostics and harden SPA boot)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a global, user-visible crash fallback so that if the React app fails to mount or throws during initial render, the page shows a clear English error state instead of a blank/failed load. This must include an Error Boundary around the app tree and a minimal fallback UI with: (1) headline indicating the app failed to load, (2) a short explanation prompting the user to refresh, and (3) a section that can reveal a technical error message/stack for debugging.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Still site isn’t loading properly"
        ]
      },
      "acceptanceCriteria": [
        "If a top-level render error is intentionally triggered, users see a styled fallback screen (not a blank page).",
        "Fallback UI text is in English and includes a refresh instruction.",
        "The fallback UI can display (or toggle) the underlying error message for troubleshooting."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add initial-load diagnostics to help identify why the deployed site fails to load, without requiring developer tools. Implement a lightweight in-app diagnostic view reachable via hash routing (e.g., `#/debug`) that displays: current URL, detected canister host/origin, build/version identifier (e.g., from Vite env or package metadata), whether the app can create the backend actor, and the status/error of a simple backend query (e.g., the same call used by the login/root flow).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Still site isn’t loading properly"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to `#/debug` renders a diagnostic page.",
        "The diagnostic page shows the current URL and origin information.",
        "The diagnostic page shows whether the backend actor is available and displays success/error results of at least one backend call.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Harden frontend bootstrapping so that common deployment/runtime issues surface clearly: ensure unhandled promise rejections and global errors are captured and presented in the crash fallback (REQ-1) and logged to console with enough context to debug (route, origin, and error).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Still site isn’t loading properly"
        ]
      },
      "acceptanceCriteria": [
        "Unhandled exceptions and unhandled promise rejections during startup are captured.",
        "When a global error occurs, the app shows the fallback UI from REQ-1 (when feasible) and logs a structured error with URL/origin context to the console."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update `frontend/DEPLOYMENT.md` to include a short, concrete 'Blank screen / site not loading' checklist that references the new `#/debug` page and describes how to verify `index.html` and bundled assets load (200 responses) on the deployed canister.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Still site isn’t loading properly"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/DEPLOYMENT.md` includes a dedicated section for 'site not loading/blank screen'.",
        "The section includes steps to open `#/debug` and interpret key signals (actor available, backend call success/error)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under the immutable frontend paths: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Preserve hash-based routing (`createHashHistory`) behavior in `frontend/src/App.tsx`.",
    "Backend must remain a single Motoko actor in `backend/main.mo` (no additional backend services)."
  ],
  "nonGoals": [
    "Adding new product features unrelated to diagnosing/fixing the loading failure (e.g., new auction/team/match functionality).",
    "Changing authentication provider (must remain Internet Identity).",
    "Introducing external logging/monitoring SaaS integrations."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}