{
  "kind": "build_request",
  "title": "Fix SPA routing so internal pages load and Not Found does not appear unexpectedly",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix client-side routing so that internal pages load correctly in production, including when users open internal URLs directly (deep links) and when navigating within the app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Remove the page not found page it is showing and still the internal pages are not getting load please fix it"
        ]
      },
      "acceptanceCriteria": [
        "Navigating via in-app buttons/links loads these routes reliably: / (Login), /team, /admin, /s/<shareId>, /debug.",
        "Opening a deep link directly in the browser address bar loads the intended page instead of Not Found (e.g., opening /team results in the Team Dashboard, opening /s/<shareId> results in the Public Scorecard).",
        "Refreshing the browser on an internal route does not land on Not Found for valid routes."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove/disable the current full-screen 'Page Not Found' experience from appearing for users during normal navigation by replacing it with a safe redirect behavior for unknown routes (e.g., redirect to the home/login route) while still allowing diagnostics access via /debug.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Remove the page not found page it is showing"
        ]
      },
      "acceptanceCriteria": [
        "When an unknown route is visited, the app automatically redirects to the home/login route and does not display the current NotFoundPage UI.",
        "Valid routes never show the NotFoundPage UI.",
        "The /debug route remains accessible and functional."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui (compose instead).",
    "Keep routing user-facing text in English."
  ],
  "nonGoals": [
    "Adding new product features unrelated to routing (e.g., new pages, new backend functionality).",
    "Changing authentication flows beyond what is required to make routing work."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}