{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Per-innings editable scorecard with player-name selection",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Implement an editable per-innings scorecard UI (Innings 1/2) with player selection by name and save-to-backend, read-only when unauthenticated.",
      "acceptanceCriteria": [
        "In the Match edit dialog, the per-innings editor allows selecting a player for each batting/bowling row from the existing Players list (showing player names), and editing the relevant numeric fields.",
        "The user can edit Innings 1 and Innings 2 independently (changes in one innings do not affect the other innings).",
        "Saving edits triggers backend mutations and the displayed scorecard refreshes immediately after success (React Query cache invalidation).",
        "If the user is not authenticated, the UI remains read-only and clearly indicates login is required (English text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MatchInningsScoreEditor.tsx",
          "operation": "modify",
          "description": "Convert the innings tabs into a true per-innings editor: render editable controls (player selector backed by the existing Players list + numeric inputs) for batting and bowling rows scoped to the currently selected innings, maintain separate local edit state per innings, and add explicit Save actions that call the new React Query mutation hooks. If the user is not authenticated (per the authorization component’s Internet Identity state), keep the UI read-only and show an English message indicating login is required to edit. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MatchManagement.tsx",
          "operation": "modify",
          "description": "Wire the editable per-innings scorecard editor into the existing match edit dialog flow: ensure the dialog that currently edits match results also presents the per-innings scorecard editor for the selected match, passes down any needed context (e.g., matchId, match data, and whether the user is authenticated via the authorization component), and ensures successful saves trigger immediate visible refresh (via React Query invalidation in hooks). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update frontend bindings/types and React Query hooks to support per-innings scorecard upsert/update APIs and new fields (e.g., bowler innings) end-to-end.",
      "acceptanceCriteria": [
        "New React Query mutation hooks exist for the new backend scorecard update/upsert APIs and are used by the per-innings editor.",
        "After successful mutations, match queries that power the scorecard UI are invalidated/refetched so the UI reflects saved changes without a manual refresh.",
        "TypeScript types used by the UI compile cleanly after the backend Candid/interface changes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Regenerate/adjust the TypeScript backend bindings to match the updated Candid after backend scorecard changes: include any new per-innings fields needed by the UI (notably BowlerPerformance. innings) and add the new/updated backend function signatures for per-innings batsman/bowler upsert/update. Ensure all imports using these types compile cleanly."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query mutation hooks for the new per-innings scorecard update/upsert backend capabilities (batsman and bowler), and ensure onSuccess invalidates/refetches the match queries that drive the scorecard UI (at minimum the existing ['allMatches'] queryKey). Handle authorization trap errors gracefully in mutations and surface usable messages to the UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/MatchInningsScoreEditor.tsx",
          "operation": "modify",
          "description": "Adopt the new hooks/types: switch innings filtering to rely on the new per-innings data (e.g., bowler innings field and/or per-innings groupings), and use the new React Query mutation hooks when saving edits so the editor reads/writes per innings correctly."
        }
      ]
    }
  ]
}