{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin assigned players: show sold price and reflect remaining purse based on sold amounts",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add a “Sold For” column in Admin → Player Management assigned players table and consume sold-amount-aware assignment data so purse/remaining purse displays stay consistent after refetch.",
      "acceptanceCriteria": [
        "The Assigned Players table shows a \"Sold For\" column for each assigned player.",
        "For players assigned via auction, the UI displays the auction winning amount as the sold amount.",
        "For manually assigned players, the UI displays the stored sold amount (defaulting to base price if that is what the backend stored).",
        "After assigning a player (manual or auction), the team purse/remaining purse displayed in the UI updates after query invalidation/refetch and matches the backend’s remaining purse calculation.",
        "No changes are made to files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (compose existing components instead)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook (e.g., useGetPlayerTeamAssignmentsWithSoldAmount) that fetches assignment rows including team id + sold amount via the existing backend actor method, and returns a lookup structure usable by the Player Management assigned table. Update relevant mutations (manual assign, remove, assign-after-auction) to invalidate/refetch this new query key alongside existing purse/budget/summary keys so UI remaining purse updates after backend recalculation."
        },
        {
          "path": "frontend/src/components/PlayerManagement.tsx",
          "operation": "modify",
          "description": "Update the Assigned Players table in Admin → Player Management to use the sold-amount-aware assignments hook and add a new \"Sold For\" column. Format the sold amount using the existing ₹ and Cr convention (e.g., \"₹ 3.20 Cr\"), and ensure unassigned players remain unaffected. Compose existing shadcn/ui Table components without modifying frontend/src/components/ui."
        }
      ]
    }
  ]
}