{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize SPA routing and replace Not Found page with safe redirect",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure client-side routing works reliably in production for in-app navigation, deep links, and refreshes across all valid routes.",
      "acceptanceCriteria": [
        "Navigating via in-app buttons/links loads these routes reliably: / (Login), /team, /admin, /s/<shareId>, /debug.",
        "Opening a deep link directly in the browser address bar loads the intended page instead of Not Found (e.g., opening /team results in the Team Dashboard, opening /s/<shareId> results in the Public Scorecard).",
        "Refreshing the browser on an internal route does not land on Not Found for valid routes."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Switch routing to use path-based history suitable for production deep links, and add a small compatibility layer that upgrades legacy hash URLs (e.g., #/team) to path URLs (e.g., /team) on initial load to prevent mismatches and unexpected Not Found states."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the pre-React boot error fallback action that navigates to diagnostics so it points to the /debug route under path-based routing (instead of using a hash route), ensuring diagnostics access works even when React fails to mount."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Document the expected SPA routing behavior in production (path-based routes like /team and /s/<shareId>) and the requirement that the host serve the app entry file for deep links/refresh so valid routes load correctly."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the full-screen NotFoundPage experience and replace it with a safe redirect for unknown routes while keeping /debug accessible.",
      "acceptanceCriteria": [
        "When an unknown route is visited, the app automatically redirects to the home/login route and does not display the current NotFoundPage UI.",
        "Valid routes never show the NotFoundPage UI.",
        "The /debug route remains accessible and functional."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SafeNotFoundRedirect.tsx",
          "operation": "create",
          "description": "Add a small router-aware component that performs a safe redirect to the home/login route for unknown routes (no full-screen 404 UI shown)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Replace current notFound handling to use SafeNotFoundRedirect (instead of NotFoundPage) as the router/root not-found behavior, while leaving the explicit /debug route unchanged and accessible."
        },
        {
          "path": "frontend/src/pages/NotFoundPage.tsx",
          "operation": "modify",
          "description": "Deprecate the NotFoundPage UI so it is not presented during normal navigation (e.g., replace with a minimal internal-only stub or comment indicating it is no longer wired into routing), ensuring user-facing routing text remains English."
        }
      ]
    }
  ]
}